## Group Data

In [1]:
import pandas as pd
import seaborn as sns

In [3]:
df = sns.load_dataset("mpg")
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [5]:
df.groupby(by="origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [6]:
df["origin"].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [7]:
df.groupby(by="origin").mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [8]:
df.groupby(by="origin")["cylinders"].mean()

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [10]:
pd.DataFrame(df.groupby(['model_year', 'origin'])['cylinders'].mean())

                   cylinders
model_year origin
70         europe   4.000000
           japan    4.000000
           usa      7.636364
71         europe   4.000000
           japan    4.000000
           usa      6.200000
72         europe   4.000000
           japan    3.800000
           usa      6.888889
73         europe   4.000000
           japan    4.250000
           usa      7.241379
74         europe   4.000000
           japan    4.000000
           usa      6.266667
75         europe   4.000000
           japan    4.000000
           usa      6.400000
76         europe   4.250000
           japan    4.500000
           usa      6.363636
77         europe   4.000000
           japan    4.166667
           usa      6.222222
78         europe   4.833333
           japan    4.000000
           usa      6.000000
79         europe   4.250000
           japan    4.000000
           usa      6.260870
80         europe   4.111111
           japan    4.076923
           usa      4.285714
81         europe   4.500000
           japan    4.333333
           usa      4.923077
82         europe   4.000000
           japan    4.000000
           usa      4.300000

In [13]:
df2 = pd.DataFrame(
    [[4, 7, 10],
    [5, 8, 11],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])
df2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [17]:
df2.shift(1)  # 모든 행이 아래로 한 칸씩 이동합니다.

     a    b     c
1  NaN  NaN   NaN
2  4.0  7.0  10.0
3  5.0  8.0  11.0

In [18]:
df2.shift(-1)  # 모든 행이 위로 한 칸씩 이동합니다.

     a    b     c
1  5.0  8.0  11.0
2  6.0  9.0  12.0
3  NaN  NaN   NaN

In [19]:
df2['a'].shift(-1)

1    5.0
2    6.0
3    NaN
Name: a, dtype: float64

In [34]:
df["model_year"].rank(method='dense').value_counts()

4.0     40
9.0     36
7.0     34
13.0    31
6.0     30
11.0    29
10.0    29
12.0    29
1.0     29
2.0     28
3.0     28
8.0     28
5.0     27
Name: model_year, dtype: int64

In [22]:
df["model_year"].rank(method='min').value_counts()

86.0     40
245.0    36
183.0    34
368.0    31
153.0    30
339.0    29
1.0      29
310.0    29
281.0    29
58.0     28
217.0    28
30.0     28
126.0    27
Name: model_year, dtype: int64

In [35]:
df["model_year"].rank(pct=True).head()

0    0.037688
1    0.037688
2    0.037688
3    0.037688
4    0.037688
Name: model_year, dtype: float64

In [36]:
df["model_year"].rank(method='first').head()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: model_year, dtype: float64

In [39]:
df2.cumsum()  # 앞에 행의 값을 누적해서 더합니다.

    a   b   c
1   4   7  10
2   9  15  21
3  15  24  33

In [41]:
df2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [42]:
df2.cummax()  # 현재 누적된 값 중 최댓값을 보여줍니다.

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [44]:
df2.cummin()  # 현재 누적된 값 중 최솟값을 보여줍니다.

   a  b   c
1  4  7  10
2  4  7  10
3  4  7  10

In [45]:
df2.cumprod()  # 누적해서 값을 곱합니다.

     a    b     c
1    4    7    10
2   20   56   110
3  120  504  1320